Repository: graphicschina/gc-image-ios-sdk
Catalog: GCImage+UISDKDemo/GCImage+UISDKDemo/*.lproj/Localizable.strings
Languages: ar, ja, ru, th, zh_hans, zh_hant

# rc_save
source: Save
ar: حفظ
ja: 保存
ru: Сохранить
th: บันทึก
zh_hans: 保存
zh_hant: 保存

# rc_image_picker_camera
source: Camera
ar: الكاميرا
ja: 写真
ru: Камера
th: กล้อง
zh_hans: 拍照
zh_hant: 拍照

# rc_image_picker_photo_library
source: Photo Library
ar: مكتبة الصور
ja: アルバム
th: ห้องสมุดภาพ
zh_hans: 相册
zh_hant: 相冊

# rc_settings_filter_selection
source: Filter Selection
ar: اختيار مرشح
ja: 特効選択
ru: Фильтр Выбор
th: การเลือกตัวกรอง
zh_hans: 特效选择
zh_hant: 特效選擇

# rc_crop_constrain_original
source: Original
ar: الأصل
ja: 原図
ru: Оригинал
th: ต้นฉบับ
zh_hans: 原图
zh_hant: 原圖

# rc_crop_constrain_square
source: Square
ar: ساحة
ja: 正方形
ru: Квадрат
th: สแควร์
zh_hans: 正方形
zh_hant: 正方形

# rc_save_title
source: Congrats !
ar: مبروك!
ja: おめでとう！
ru: Поздравляю!
th: ขอแสดงความยินดี!
zh_hans: 恭喜！
zh_hant: 恭喜！

# rc_save_message
source: Photo has been saved into the album: %@
ar: تم حفظ صور في الألبوم: %@
ja: 写真はアルバム：%@
ru: Фото были сохранены в альбоме: %@
th: ภาพที่ได้รับการบันทึกลงในอัลบั้ม: %@
zh_hans: 照片已存入相册：%@
zh_hant: 照片已存入相冊：%@

# rc_save_button_ok
source: OK
ja: 確定
th: ตกลง
zh_hans: 确定
zh_hant: 確定

# rc_settings_speed_fast
source: Fast
ar: سريع
ja: 高速
ru: Быстрый
th: เร็ว
zh_hans: 快
zh_hant: 快

# rc_settings_speed_slow
source: Slow
ar: بطيء
ja: 遅い
th: ช้า
zh_hans: 慢
zh_hant: 慢

# rc_launch_screen_slogan
source: IT CAN BE MORE BEAUTIFUL!
ar: يمكن أن يكون أكثر جمالا!
ja: もとはこのように美しい！
ru: Это может быть прекраснее!
th: มันอาจจะเป็นความสวยงามมากขึ้น!
zh_hans: 原来可以这么美！
zh_hant: 原來可以這麽美！

# rc_launch_screen_slogan_powered_by
source: CoGraphics is powered by GCImageSDK™
ar: هو مدعوم من قبل الرسومات GCImageSDK™
ja: グラフィックスは GCImageSDK™ によって供給されています
ru: сографика питается от GCImageSDK™
th: กราฟิกโดยใช้พลังงานจาก GCImageSDK™
zh_hans: 可图基于 GCImageSDK™ 技术构建
zh_hant: 可圖基于 GCImageSDK™ 技術構建

# rc_launch_screen_start_filtering_journey
source: START
ar: البدء
ja: 開く美図の旅
th: เริ่มต้น
zh_hans: 开启美图之旅
zh_hant: 開啓美圖之旅

# rc_launch_screen_gcimagesdk_slogan
source: Make your app a great first impression!
ar: جعل التطبيق الخاص بك كبير الانطباع الأول!
ja: アプリケーションは、しっかりとユーザーの心をつかむことができます！
ru: Сделать ваше приложение хорошее первое впечатление!
th: ให้ app ของคุณประทับใจแรกที่ดี!
zh_hans: 让您的应用能牢牢抓住用户的心!
zh_hant: 讓您的應用能牢牢抓住用戶的心!

# rc_launch_screen_ads_invest_us
source: Invest Us
ar: انفست بنا
ja: 投資たち
ru: Инвест связь
th: การลงทุนของเรา
zh_hans: 投资我们
zh_hant: 投資我們

# rc_launch_screen_ads_technology
source: Technology
ar: التكنولوجيا
ja: 技術サポート
ru: Технология
th: เทคโนโลยี
zh_hans: 技术支持
zh_hant: 技術支持

# rc_launch_screen_ads_business
source: Business
ar: الأعمال
ja: 業務提携
ru: Бизнес
th: ธุรกิจ
zh_hans: 商务合作
zh_hant: 商務合作

# rc_introduction_graphics_china_leading
source: Leading global mobile graphics technology
ar: قيادة التكنولوجيا العالمية الرسومات المتحركة
ja: 主要なモバイル画像処理技術
ru: Ведущий мировой графическую технологию для мобильных устройств
th: กราฟิกชั้นนำมือถือทั่วโลกเทคโนโลยี
zh_hans: 领先的移动图像处理技术
zh_hant: 領先的移動圖像處理技術

# rc_introduction_open_platform
source: Open Image SDK Platform
ar: وفتح ملف الصور SDK منصة
ja: オープン画像処理プラットフォームSDK
ru: Open Image SDK платформы
th: เปิดรูป SDK แพลตฟอร์ม
zh_hans: 开放的图像处理平台 SDK
zh_hant: 開放的圖像處理平台 SDK

# rc_introduction_permanent_free
source: Permanent Free
ar: الحرة الدائم
ja: 永遠に自由
ru: Постоянная бесплатно
th: ฟรีถาวร
zh_hans: 永久免费
zh_hant: 永久免費

# rc_introduction_beautiful
source: Makes Apps Beautiful
ar: يجعل تطبيقات جميل
ja: アプリケーションを使用すると、簡単に美しい写真を作成することができます。
ru: Делает приложения Beautiful
th: ทำให้ปพลิเคชันที่สวยงาม
zh_hans: 让您的应用轻松制作优美照片
zh_hant: 讓您的應用輕松制作優美照片

# rc_introduction_let_app_create_great_images
source: Let Your App to Create Great Images Easily
ar: دعونا التطبيق الخاص بك لخلق صور رائعة بسهولة
ja: アプリケーションを使用すると、簡単に美しい写真を作成することができます。
ru: Let Your приложение для создания великолепных снимков Легко
th: ให้ App ของคุณที่จะสร้างภาพที่ดีได้อย่างง่ายดาย
zh_hans: 让您的应用轻松制作精美照片
zh_hant: 讓您的應用輕松制作精美照片

# rc_introduction_powerful
source: Powerful Image Filter
ar: صورة المرشح قوية
ja: 強力なグラフィックス処理能力
ru: Мощный фильтр изображения
th: ตัวกรองภาพที่มีประสิทธิภาพ
zh_hans: 强大的图形处理能力
zh_hant: 強大的圖形處理能力

# rc_introduction_stable
source: Stable
ar: مستقر
ja: 安定した
ru: Стабильный
zh_hans: 稳定
zh_hant: 穩定

# rc_introduction_efficient
source: Efficient
ar: فعالة
ja: 高速
ru: Эффективное
th: มีประสิทธิภาพ
zh_hans: 高速
zh_hant: 高速

# rc_introduction_easy_to_integrate
source: Easy to Integrate
ar: من السهل دمج
ja: 簡単に統合する
ru: Простота интеграции
th: ง่ายต่อการรวม
zh_hans: 极其容易集成
zh_hant: 極其容易集成

# rc_introduction_even_two_lines_code
source: Even 2 Line Code
ar: وحتى 2 رمز لاين
ja: 2 行のコードだけ少なく
ru: Даже 2 Код строки
th: แม้ 2 สายรหัส
zh_hans: 最少只需 2 行代码
zh_hant: 最少只需 2 行代碼

# rc_introduction_create_and_present
source: Create a Controller, and then Present
ar: إنشاء وحدة تحكم، ومن ثم الحاضر
ja: ポップアップその後、コントローラを作成する
ru: Создать контроллера, а затем представить
th: สร้างตัวควบคุมแล้วปัจจุบัน
zh_hans: 创建 controller，然后弹出
zh_hant: 創建 controller，然後彈出

# rc_introduction_embedded_filter_framework
source: Embedded Filter Library
ar: مكتبة تصفية (فلترة) جزءا لا يتجزأ من
ja: を埋め込むだけ画像エフェクトライブラリ
ru: Встроенные фильтр Библиотека
th: ห้องสมุดกรองสมองกลฝังตัว
zh_hans: 只嵌入图像特效库
zh_hant: 只嵌入圖像特效庫

# rc_introduction_embedded_full_functional_ui
source: Embedded with Full Functional UI
ar: جزءا لا يتجزأ مع UI الوظيفي كامل
ja: エフェクトライブラリでフル機能のインタフェースを埋め込む
ru: Встроенные в полнофункциональную UI
th: ฝังตัวอยู่กับ UI ใช้งานเต็มรูปแบบ
zh_hans: 嵌入全功能带界面特效库
zh_hant: 嵌入全功能帶界面特效庫

# rc_introduction_ui_style_can_be_changed
source: UI Style Can be Changed Accordingly
ar: واجهة المستخدم نمط يمكن تغييرها تبعا لذلك
ja: インタフェースは特殊効果をカスタマイズすることができます
ru: Стиль пользовательского интерфейса могут быть соответствующим образом изменить
th: สไตล์ UI สามารถเปลี่ยนแปลงดังนั้น
zh_hans: 特效界面可按需求定制
zh_hant: 特效界面可按需求定制

# rc_introduction_color_category
source: Color
ar: اللون
ja: 色クラス
ru: Цвет
th: สี
zh_hans: 颜色类
zh_hant: 顔色類

# rc_introduction_blend_category
source: Blend
ar: مزيج
ja: ハイブリッドクラス
ru: смесь
th: เบลนด์
zh_hans: 混合类
zh_hant: 混合類

# rc_introduction_frame_category
source: Frame
ar: الإطار
ja: 国境クラス
ru: Кадр
th: กรอบ
zh_hans: 边框类
zh_hant: 邊框類

# rc_introduction_distort_category
source: Distort
ar: تشويه
ja: 変形クラス
zh_hans: 变形类
zh_hant: 變形類

# rc_introduction_blur_category
source: Blur
ar: الضبابية
ja: ファジークラス
ru: Размытие
zh_hans: 模糊类
zh_hant: 模糊類

# rc_introduction_renews_continually
source: Renews Continually...
ar: تجدد باستمرار...
ja: 継続的に更新...
ru: вновь Постоянно...
th: ต่ออายุอย่างต่อเนื่อง...
zh_hans: 持续更新中...
zh_hant: 持續更新中...

# rc_introduction_skip
source: Skip
ar: تخطي
ja: スキップ
ru: Перейти
th: ข้าม
zh_hans: 跳过
zh_hant: 跳過

# rc_introduction_recommend_us
source: Please recommend GCImageSDK to App Developers you know!
ar: يرجى يوصي GCImageSDK لتطبيقات المطورين تعلمون!
ja: あなたが知っているアプリ開発者にGCImageSDKをお勧めしてください！
ru: Пожалуйста, рекомендуем GCImageSDK в App разработчиков вы знаете!
th: โปรดแนะนำ GCImageSDK เพื่อพัฒนา App คุณรู้!
zh_hans: 请将 GCImageSDK 推荐给您认识的 App 开发者！
zh_hant: 請將 GCImageSDK 推薦給您認識的 App 開發者！

# rc_introduction_find_us
source: Search 'GCImageSDK' on Google/Baidu/Yahoo!/Yandex/...
ar: البحث 'GCImageSDK' على جوجل / بايدو / ياهو / ياندكس / ...
ja: グーグル/百度/ヤフーの検索」GCImageSDK'/ Yandexの/...！
ru: Поиск 'GCImageSDK' на Google/Baidu/Yahoo!/Yandex/...
th: ค้นหา 'GCImageSDK' บน Google/Baidu/Yahoo!/Yandex/...
zh_hans: 请在 Google/Baidu/Yahoo!/Yandex/... 上搜索关键字'GCImageSDK'
zh_hant: 請在 Google/Baidu/Yahoo!/Yandex/... 上搜索關鍵字'GCImageSDK'
